# InvalidLoadClassificationValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..InvalidLoadClassificationValue Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
The load classification parameter cannot be empty. Please select a valid load classification element for the connector parameter and the associated family parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidLoadClassificationValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidLoadClassificationValue As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidLoadClassificationValue {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace